{
  "aboutUs": {
    "title": "О нас",
    "description": "MediScanAI - это инновационная платформа, использующая искусственный интеллект для улучшения медицинской диагностики и анализа. Мы стремимся сделать здравоохранение более точным и эффективным.",
    "contactButton": "Свяжитесь с нами",
    "coreValues": "Наши основные ценности",
    "clientOpinions": "Что говорят наши клиенты",
    "mission": {
      "title": "Наша миссия",
      "text": "Вооружить медицинских работников инструментами на базе ИИ, которые улучшают точность диагностики и результаты лечения пациентов через основанные на данных знания."
    },
    "vision": {
      "title": "Наше видение",
      "text": "Стать мировым лидером в медицинской диагностике на базе ИИ, делая передовую медицинскую аналитику доступной и практичной для медицинских работников по всему миру."
    },
    "values": {
      "title": "Наши ценности",
      "text": "Инновации, точность и доверие - наш фундамент. Мы стремимся разрабатывать передовые решения, поддерживая высочайшие стандарты безопасности данных и клинической точности."
    },
    "opinions": {
      "0": {
        "name": "Др. Сара Чен",
        "description": "MediScanAI изменил наш подход к анализу медицинских данных. Знания, предоставляемые ИИ, бесценны для принятия клинических решений."
      },
      "1": {
        "name": "Др. Майкл Робертс",
        "description": "Точность и скорость платформы в обработке сложных медицинских данных значительно улучшили наши диагностические возможности."
      },
      "2": {
        "name": "Др. Анна Петросян",
        "description": "Отличный инструмент, который улучшил наш рабочий процесс и усилил нашу способность предоставлять точную помощь пациентам."
      },
      "3": {
        "name": "Др. Джеймс Уилсон",
        "description": "Внедрение ИИ через MediScanAI в медицинскую диагностику революционизировало наш подход к уходу за пациентами."
      },
      "4": {
        "name": "Др. Мария Гарсия",
        "description": "Впечатляющая точность анализа и интуитивный интерфейс делают эту платформу незаменимой для современного здравоохранения."
      },
      "5": {
        "name": "Др. Дэвид Ким",
        "description": "Всесторонние отчеты платформы значительно улучшили нашу диагностическую эффективность и коммуникацию с пациентами."
      },
      "6": {
        "name": "Др. Лиза Томпсон",
        "description": "MediScanAI предоставляет надежные, быстрые результаты, которые стали неотъемлемой частью нашего процесса принятия клинических решений."
      },
      "7": {
        "name": "Др. Роберт Браун",
        "description": "Инновационное решение, которое значительно улучшило наши диагностические возможности и качество ухода за пациентами."
      }
    },
    "meetOurTeam":{
      "title": "Наша команда",
      "description": "Наша команда состоит из ведущих экспертов в области здравоохранения, искусственного интеллекта и науки о данных, которые стремятся продвигать медицинскую диагностику с помощью инновационных технологий.",
      "members": {
        "0": {
          "name": "Ваче Асеян",
          "position": "Frontend Программист",
          "description": "Ваче обладает экспертизой в области фронтенд-технологий, обеспечивая функциональность и визуальную привлекательность наших приложений."
        
        },
         "1": {
          "name": "Ваге Нерсесян",
          "position": "Frontend Программист",
          "description": "Ваге специализируется на фронтенд-разработке, сосредотачиваясь на создании отзывчивых и доступных веб-приложений, соответствующих потребностям пользователей."
        
        },
         "2": {
          "name": "Артур Баграмян",
          "position": "Frontend Программист",
          "description": "Артур умеет создавать интуитивно понятные пользовательские интерфейсы, улучшая пользовательский опыт с помощью инновационного дизайна и функциональности."
        
        },
         "3": {
          "name": "Араик Авагян",
          "position": "Frontend Программист",
          "description": "Араик сосредоточен на фронтенд-разработке, используя современные фреймворки для создания эффективных и масштабируемых веб-приложений."
        
        },
         "4": {
          "name": "Давид Мутафян",
          "position": "Frontend Программист",
          "description": "Давид является экспертом в области фронтенд-технологий, стремясь предоставить высококачественный пользовательский опыт через тщательный дизайн и разработку."
        
        }
      }
    },
    "location": {
      "title": "Наше местоположение",
      "description": "Посетите центральный офис MediScanAI, чтобы узнать, как мы трансформируем здравоохранение через инновации ИИ.",
      "phone": "Тел: +374 91 234 567"
    }
  }
}
