{
  "geneticAnalysis": {
    "BRCA1": "BRCA1",
    "BRCA2": "BRCA2",
    "FactorVLeiden": "Фактор V Лейдена",
    "APOE": "APOE",
    "MTHFR": "MTHFR",
    "CYP2C19": "CYP2C19",
    "title": "Результаты генетического теста",
    "subtitle": "Анализ с ИИ",
    "warnings": {
      "title": "🚨 Предупреждения о рисках для здоровья",
      "analyzeButton": "Анализировать с ИИ",
      "showMore": "Показать больше",
      "showLess": "Показать меньше",
      "allGood": "✅ Все ваши показатели в норме. Отличный результат!",
      "conditions": {
        "brca1Positive": "⚠️ BRCA1 положительный — повышенный риск рака",
        "brca2Positive": "⚠️ BRCA2 положительный — повышенный риск рака",
        "factorVLeidenPositive": "⚠️ Фактор V Лейдена положительный — риск тромбозов",
        "apoeE4E4": "⚠️ APOE ε4/ε4 — высокий риск болезни Альцгеймера",
        "mthfrHomozygous": "⚠️ MTHFR гомозигота — влияние на метаболизм фолатов",
        "cyp2c19PoorMetabolizer": "⚠️ CYP2C19 медленный метаболизм — измененный ответ на лекарства"
      },
      "explanations": {
        "brca1Positive": "Положительный результат BRCA1 указывает на мутацию в этом гене-супрессоре опухолей, что значительно увеличивает пожизненный риск рака груди (до 72%), яичников (до 44%) и других видов рака. BRCA1 помогает восстанавливать повреждения ДНК; мутации нарушают эту функцию. Тактика включает усиленный скрининг (МРТ/маммография), препараты для снижения риска или профилактические операции. Не все носители заболевают раком, но бдительность важна. Генетическое консультирование помогает интерпретировать результаты и организовать тестирование семьи.",
        "brca2Positive": "Мутации BRCA2 повышают риски рака груди (до 69%), яичников (до 17%), поджелудочной железы и других видов. Как и BRCA1, он участвует в репарации ДНК. У мужчин-носителей повышен риск рака груди и простаты. Тактика аналогична BRCA1, с учетом скрининга рака поджелудочной железы для семей высокого риска. Ингибиторы PARP особенно эффективны при BRCA-ассоциированных раках.",
        "factorVLeidenPositive": "Factor V Лейден делает кровь устойчивой к протеину C, увеличивая риск тромбозов в 5-10 раз (гетерозиготы) или 50-100 раз (гомозиготы). Большинство носителей никогда не сталкиваются с тромбами, но риски растут при операциях, беременности или приеме гормонов. Симптомы включают ТГВ или ТЭЛА. Тактика направлена на профилактику тромбозов в рискованных ситуациях. Пожизненные антикоагулянты обычно не нужны без истории тромбозов.",
        "apoeE4E4": "Две аллели ε4 дают наивысший риск Альцгеймера (до 15x). Белок ε4 менее эффективно удаляет амилоидные бляшки. Однако не все носители заболевают. Профилактика включает здоровый для сердца образ жизни (спорт, средиземноморская диета, когнитивная активность). Предиктивное тестирование обычно не рекомендуется из-за ограниченной клинической пользы.",
        "mthfrHomozygous": "Гомозиготные мутации C677T снижают активность фермента на ~70%, потенциально повышая гомоцистеин. Клиническая значимость спорна, но может умеренно увеличивать сердечно-сосудистые и акушерские риски. Тактика может включать метилфолат (не фолиевую кислоту) при повышенном гомоцистеине, хотя рутинное лечение не универсально рекомендовано.",
        "cyp2c19PoorMetabolizer": "Медленные метаболизаторы очень медленно перерабатывают некоторые препараты, увеличивая побочные эффекты или требуя коррекции дозы. Затронуты клопидогрел (сниженная эффективность), многие антидепрессанты и ИПП. Фармакогенетическое тестирование может подобрать альтернативы (например, прасугрел вместо клопидогреля) или скорректировать дозы."
      }
    },
    "geneticTest": {
      "positive": "Положительный",
      "negative": "Отрицательный"
    },
    "facts": {
      "BRCA1": [
        "Мутации BRCA1 увеличивают риск рака молочной железы до 72% и рака яичников до 44%.",
        "Ген BRCA1 помогает репарировать поврежденную ДНК и поддерживать геномную стабильность.",
        "Мужчины с мутациями BRCA1 имеют повышенный риск рака молочной железы и простаты."
      ],
      "BRCA2": [
        "Мутации BRCA2 увеличивают риск рака молочной железы до 69% и рака яичников до 17%.",
        "BRCA2 играет ключевую роль в репарации ДНК через гомологичную рекомбинацию.",
        "Мутации BRCA2 значительно увеличивают риск рака поджелудочной железы у обоих полов."
      ],
      "Factor V Leiden": [
        "Фактор V Лейдена — наиболее распространенное наследственное нарушение свертываемости крови.",
        "Около 5% европеоидов являются носителями хотя бы одной копии мутации.",
        "Гетерозиготные носители имеют в 5-10 раз более высокий риск тромбов."
      ],
      "APOE": [
        "APOE ε4 — самый сильный генетический фактор риска болезни Альцгеймера с поздним началом.",
        "APOE помогает транспортировать холестерин и жиры в кровотоке.",
        "Около 25% людей имеют одну ε4 аллель; 2-3% имеют две копии."
      ],
      "MTHFR": [
        "Мутации MTHFR влияют на метаболизм фолатов и уровень гомоцистеина.",
        "C677T — наиболее распространенный вариант, присутствующий у 30-40% некоторых популяций.",
        "Гомозиготный C677T может увеличить риск сердечных заболеваний, инсульта и врожденных дефектов."
      ],
      "CYP2C19": [
        "CYP2C19 метаболизирует многие лекарства, включая антидепрессанты, клопидогрел и ИПП.",
        "Медленные метаболизаторы могут нуждаться в альтернативных лекарствах или коррекции дозы.",
        "Около 2-15% людей являются медленными метаболизаторами, варьируя по этнической принадлежности."
      ]
    },
    "noData": {
      "title": "Пожалуйста, заполните результаты генетического теста для получения аналитики",
      "button": "Заполнить результаты генетического теста"
    }
  }
}
