{
  "aboutUs": {
    "title": "About Us",
    "description": "We are a pioneering healthcare technology company leveraging artificial intelligence to revolutionize medical diagnostics and patient care.",
    "contactButton": "Contact Us",
    "coreValues": "Our Core Values",
    "clientOpinions": "What Our Clients Say",
    "mission": {
      "title": "Our Mission",
      "text": "To empower healthcare professionals with AI-driven tools that enhance diagnostic accuracy and improve patient outcomes through data-driven insights."
    },
    "vision": {
      "title": "Our Vision",
      "text": "To be the global leader in AI-powered medical diagnostics, making advanced healthcare analytics accessible and actionable for medical professionals worldwide."
    },
    "values": {
      "title": "Our Values",
      "text": "Innovation, accuracy, and trust are at our core. We are committed to developing cutting-edge solutions while maintaining the highest standards of data security and clinical precision."
    },
    "meetOurTeam":{
      "title": "Meet Our Team",
      "description": "Our team consists of leading experts in healthcare, artificial intelligence, and data science, dedicated to advancing medical diagnostics through innovative technology.",
      "members": {
        "0": {
          "name": "Vache Aseyan",
          "position": "Frontend Developer",
         "description": "Vache brings expertise in frontend technologies, ensuring that our applications are both functional and visually appealing."
        
        },
         "1": {
          "name": "Vahe Nersesyan",
          "position": "Frontend Developer",
          "description": "Vahe specializes in frontend development, focusing on building responsive and accessible web applications that meet user needs."
        
        },
         "2": {
          "name": "Artur Baghramyan",
          "position": "Frontend Developer",
          "description": "Artur is skilled in creating intuitive user interfaces, enhancing user experience through innovative design and functionality."
        
        },
         "3": {
          "name": "Arayik Avagyan",
          "position": "Frontend Developer",
          "description": "Arayik focuses on frontend development, utilizing modern frameworks to build efficient and scalable web applications."
        
        },
         "4": {
          "name": "Davit Mutafyan",
          "position": "Frontend Developer",
          "description": "Davit is an expert in frontend technologies, dedicated to delivering high-quality user experiences through meticulous design and development."
        
        }
      }
    },
    "opinions": {
      "0": {
        "name": "Dr. Sarah Chen",
        "description": "MediScanAI has transformed how we analyze medical data. The AI insights have proven invaluable for making informed clinical decisions."
      },
      "1": {
        "name": "Dr. Michael Roberts",
        "description": "The platform's accuracy and speed in processing complex medical data have significantly improved our diagnostic capabilities."
      },
      "2": {
        "name": "Dr. Anna Petrosyan",
        "description": "An excellent tool that has streamlined our workflow and enhanced our ability to provide precise patient care."
      },
      "3": {
        "name": "Dr. James Wilson",
        "description": "The integration of AI in medical diagnostics through MediScanAI has revolutionized our approach to patient care."
      },
      "4": {
        "name": "Dr. Maria Garcia",
        "description": "Impressive accuracy in analysis and an intuitive interface make this platform essential for modern healthcare."
      },
      "5": {
        "name": "Dr. David Kim",
        "description": "The platform's comprehensive reports have greatly improved our diagnostic efficiency and patient communication."
      },
      "6": {
        "name": "Dr. Lisa Thompson",
        "description": "MediScanAI provides reliable, fast results that have become integral to our clinical decision-making process."
      },
      "7": {
        "name": "Dr. Robert Brown",
        "description": "An innovative solution that has significantly enhanced our diagnostic capabilities and patient care quality."
      }
    },
    "location": {
      "title": "Our Location",
      "description": "Visit our MediScanAI headquarters to discover how we're transforming healthcare through AI innovation",
      "phone": "Tel: +374 91 234 567"
    }
  }
}
